podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/I2C0_MK10D5.svd.xml
            <register>
               <name>FLT</name>
               <description>Programmable Input Glitch Filter register</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>FLT</name>
                     <description>Programmable Filter Factor\n
Controls the width of the glitch, in terms of I2C module clock cycles, that the filter must absorb.\n
For any glitch whose size is less than or equal to this width setting, the filter does not allow the glitch to pass</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No filter/bypass</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RA</name>
               <description>Range Address register</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RAD</name>
                     <description>Range Slave Address</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMB</name>
               <description>SMBus Control and Status register</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SHTF2IE</name>
                     <description>SHTF2 Interrupt Enable\n
Enables SCL high and SDA low timeout interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SHTF2</name>
                     <description>SCL High Timeout Flag 2\n
This bit sets when SCL is held high and SDA is held low more than LoValue/512 clock cycles.\n
Software clears this bit by writing a 1 to it</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No timeout occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timeout occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SHTF1</name>
                     <description>SCL High Timeout Flag 1\n
This read-only bit sets when SCL and SDA are held high more than LoValue/512 clock cycles, which indicates the bus is free.\n
This bit is cleared automatically</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No timeout occurs</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timeout occurs</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="SHTF1" > <name>SLTF</name> <description>SCL Low Timeout Flag\n
This bit is set when the SLT register (consisting of the SLTH and SLTL registers) is loaded with a non-zero value (LoValue) and an SCL low timeout occurs
Software clears this bit by writing a logic 1 to it</description> <bitOffset>3</bitOffset> <access>read-write</access> </field>
                  <field>
                     <name>TCKSEL</name>
                     <description>Timeout Counter Clock Select\n
Selects the clock source of the timeout counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Bus clock / 64</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Bus clock</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIICAEN</name>
                     <description>Second I2C Address Enable\n
Enables or disables SMBus device default address</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Address 2 matching disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Address 2 matching enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ALERTEN</name>
                     <description>SMBus Alert Response Address Enable\n
Enables or disables SMBus alert response address matching</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>SMBus alert matching is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>SMBus alert matching is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FACK</name>
                     <description>Fast NACK/ACK Enable\n
For SMBus packet error checking, the CPU must be able to issue an ACK or NACK according to the result of receiving data byte</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ACK/NAK on data byte\t- An ACK or NACK is sent on the following receiving data byte</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ACK/NAK on TXAK write\t- Writing 0 to TXAK after receiving a data byte generates an ACK. Writing 1 to TXAK after receiving a data byte generates a NACK</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>A2</name>
               <description>Address Register 2</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0xC2</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SAD</name>
                     <description>SMBus Address\n
Contains the slave address used by the SMBus.\n
This field is used on the device default address or other related addresses</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLTH</name>
               <description>SCL Low Timeout Register High</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SSLT</name>
                     <description>MSB of SCL low timeout value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLTL</name>
               <description>SCL Low Timeout Register Low</description>
               <addressOffset>0xB</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SSLT</name>
                     <description>LSB of SCL low timeout value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
